{"class_name": "Model", "config": {"name": "model_39", "layers": [{"name": "input_30", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "name": "input_30"}, "inbound_nodes": []}, {"name": "dense_23", "class_name": "Dense", "config": {"name": "dense_23", "trainable": true, "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_30", 0, 0, {}]]]}, {"name": "leaky_re_lu_184", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_184", "trainable": true, "alpha": 0.0}, "inbound_nodes": [[["dense_23", 0, 0, {}]]]}, {"name": "reshape_17", "class_name": "Reshape", "config": {"name": "reshape_17", "trainable": true, "target_shape": [2, 2, 256]}, "inbound_nodes": [[["leaky_re_lu_184", 0, 0, {}]]]}, {"name": "conv2d_transpose_81", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_81", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["reshape_17", 0, 0, {}]]]}, {"name": "leaky_re_lu_185", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_185", "trainable": true, "alpha": 0.0}, "inbound_nodes": [[["conv2d_transpose_81", 0, 0, {}]]]}, {"name": "conv2d_transpose_82", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_82", "trainable": true, "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["leaky_re_lu_185", 0, 0, {}]]]}, {"name": "leaky_re_lu_186", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_186", "trainable": true, "alpha": 0.0}, "inbound_nodes": [[["conv2d_transpose_82", 0, 0, {}]]]}, {"name": "conv2d_transpose_83", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_83", "trainable": true, "filters": 32, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["leaky_re_lu_186", 0, 0, {}]]]}, {"name": "leaky_re_lu_187", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_187", "trainable": true, "alpha": 0.0}, "inbound_nodes": [[["conv2d_transpose_83", 0, 0, {}]]]}, {"name": "conv2d_transpose_84", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_84", "trainable": true, "filters": 16, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["leaky_re_lu_187", 0, 0, {}]]]}, {"name": "leaky_re_lu_188", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_188", "trainable": true, "alpha": 0.0}, "inbound_nodes": [[["conv2d_transpose_84", 0, 0, {}]]]}, {"name": "conv2d_transpose_85", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_85", "trainable": true, "filters": 1, "kernel_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["leaky_re_lu_188", 0, 0, {}]]]}], "input_layers": [["input_30", 0, 0]], "output_layers": [["conv2d_transpose_85", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}